# Part 1

# Series

Data Type Name - Series

There are some differences worth noting between ndarrays and Series objects. First of all, elements in NumPy arrays are accessed by their integer position, starting with zero for the first element. A pandas Series Object is more flexible as you can use define your own labeled index to index and access elements of an array. You can also use letters instead of numbers, or number an array in descending order instead of ascending order. Second, aligning data from different Series and matching labels with Series objects is more efficient than using ndarrays, for example dealing with missing values. If there are no matching labels during alignment, pandas returns NaN (not any number) so that the operation does not fail.

Source: “Learning pandas”, Michael Heyd (Packt Publishing).


Let us explore the same:

In [5]:
import numpy as np
import pandas as pd

### Creating a Series using Pandas

You could convert a list,numpy array, or dictionary to a Series in the following manner

In [6]:
labels = ['w','x','y','z']
list = [10,20,30,40]
array = np.array([10,20,30,40])
dict = {'w':10,'x':20,'y':30,'z':40}

** Using Lists**

In [7]:
pd.Series(data=list)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
pd.Series(data=list,index=labels)

w    10
x    20
y    30
z    40
dtype: int64

In [9]:
pd.Series(list,labels)

w    10
x    20
y    30
z    40
dtype: int64

** Using NumPy Arrays to create Series **

In [10]:
pd.Series(array)

0    10
1    20
2    30
3    40
dtype: int32

In [11]:
pd.Series(array,labels)

w    10
x    20
y    30
z    40
dtype: int32

** Using Dictionary to create series **

In [12]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

## Using an Index

We shall now see how to index in a Series using the following examples of 2 series

In [9]:
sports1 = pd.Series([1,2,3,4],index = ['Cricket', 'Football','Basketball', 'Golf'])

In [10]:
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [11]:
sports2 = pd.Series([1,2,5,4],index = ['Cricket', 'Football','Baseball', 'Golf'])

In [12]:
sports2

Cricket     1
Football    2
Baseball    5
Golf        4
dtype: int64

In [13]:
sports1['Cricket']

1

Operations are then also done based off of index:

In [14]:
sports1 + sports2

Baseball      NaN
Basketball    NaN
Cricket       2.0
Football      4.0
Golf          8.0
dtype: float64

# Part 2

# DataFrames

DataFrames concept in python is similar to that of R programming language. DataFrame is a collection of Series combined together to share the same index positions.

In [2]:
from numpy.random import randn
np.random.seed(1)

In [51]:
dataframe = pd.DataFrame(randn(10,5),index='A B C D E F G H I J'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())

In [52]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -0.447129  1.224508  0.403492  0.593579 -1.094912
B  0.169382  0.740556 -0.953701 -0.266219  0.032615
C -1.373117  0.315159  0.846161 -0.859516  0.350546
D -1.312283 -0.038696 -1.615772  1.121418  0.408901
E -0.024617 -0.775162  1.273756  1.967102 -1.857982
F  1.236164  1.627651  0.338012 -1.199268  0.863345
G -0.180920 -0.603921 -1.230058  0.550537  0.792807
H -0.623531  0.520576 -1.144341  0.801861  0.046567
I -0.186570 -0.101746  0.868886  0.750412  0.529465
J  0.137701  0.077821  0.618380  0.232495  0.682551

## Selection and Indexing

Ways in which we can grab data from a DataFrame

In [6]:
dataframe['Score3']

A   -1.142518
B    0.931102
C    0.512930
D    1.519817
E    0.160037
F    0.827975
G    0.186561
H    0.377564
I   -0.375285
J    0.043597
Name: Score3, dtype: float64

In [7]:
# Pass a list of column names in any order necessary
dataframe[['Score2','Score1']]

     Score2    Score1
A -0.352250  0.300170
B  0.838983  0.586623
C  1.252868 -0.754398
D  1.131629 -0.075572
E -0.504466 -1.444114
F -0.306204 -2.022201
G -0.200758 -0.222328
H -0.670662  0.119009
I  0.185156  1.198918
J -0.343854  0.077340

DataFrame Columns are nothing but a Series each

In [8]:
type(dataframe['Score1'])

pandas.core.series.Series

**Adding a new column to the DataFrame**

In [9]:
dataframe['Score6'] = dataframe['Score1'] + dataframe['Score2']

In [10]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894 -0.052080
B  0.586623  0.838983  0.931102  0.285587  0.885141  1.425607
C -0.754398  1.252868  0.512930 -0.298093  0.488518  0.498470
D -0.075572  1.131629  1.519817  2.185575 -1.396496  1.056058
E -1.444114 -0.504466  0.160037  0.876169  0.315635 -1.948580
F -2.022201 -0.306204  0.827975  0.230095  0.762011 -2.328405
G -0.222328 -0.200758  0.186561  0.410052  0.198300 -0.423086
H  0.119009 -0.670662  0.377564  0.121821  1.129484 -0.551654
I  1.198918  0.185156 -0.375285 -0.638730  0.423494  1.384074
J  0.077340 -0.343854  0.043597 -0.620001  0.698032 -0.266514

** Removing Columns from DataFrame**

In [15]:
dataframe.drop('Score6',axis=1)              # Use axis=0 for dropping rows and axis=1 for dropping columns

     Score1    Score2    Score3    Score4    Score5
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894
B  0.586623  0.838983  0.931102  0.285587  0.885141
C -0.754398  1.252868  0.512930 -0.298093  0.488518
D -0.075572  1.131629  1.519817  2.185575 -1.396496
E -1.444114 -0.504466  0.160037  0.876169  0.315635
F -2.022201 -0.306204  0.827975  0.230095  0.762011
G -0.222328 -0.200758  0.186561  0.410052  0.198300
H  0.119009 -0.670662  0.377564  0.121821  1.129484
I  1.198918  0.185156 -0.375285 -0.638730  0.423494
J  0.077340 -0.343854  0.043597 -0.620001  0.698032

In [16]:
# column is not dropped unless inplace input is TRUE
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894 -0.052080
B  0.586623  0.838983  0.931102  0.285587  0.885141  1.425607
C -0.754398  1.252868  0.512930 -0.298093  0.488518  0.498470
D -0.075572  1.131629  1.519817  2.185575 -1.396496  1.056058
E -1.444114 -0.504466  0.160037  0.876169  0.315635 -1.948580
F -2.022201 -0.306204  0.827975  0.230095  0.762011 -2.328405
G -0.222328 -0.200758  0.186561  0.410052  0.198300 -0.423086
H  0.119009 -0.670662  0.377564  0.121821  1.129484 -0.551654
I  1.198918  0.185156 -0.375285 -0.638730  0.423494  1.384074
J  0.077340 -0.343854  0.043597 -0.620001  0.698032 -0.266514

In [17]:
dataframe.drop('Score6',axis=1,inplace=True)

In [21]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894
B  0.586623  0.838983  0.931102  0.285587  0.885141
C -0.754398  1.252868  0.512930 -0.298093  0.488518
D -0.075572  1.131629  1.519817  2.185575 -1.396496
E -1.444114 -0.504466  0.160037  0.876169  0.315635
F -2.022201 -0.306204  0.827975  0.230095  0.762011
G -0.222328 -0.200758  0.186561  0.410052  0.198300
H  0.119009 -0.670662  0.377564  0.121821  1.129484
I  1.198918  0.185156 -0.375285 -0.638730  0.423494
J  0.077340 -0.343854  0.043597 -0.620001  0.698032

Dropping rows using axis=0

In [22]:
dataframe.drop('A',axis=0)      # Row will also be dropped only if inplace=TRUE is given as input

     Score1    Score2    Score3    Score4    Score5
B  0.586623  0.838983  0.931102  0.285587  0.885141
C -0.754398  1.252868  0.512930 -0.298093  0.488518
D -0.075572  1.131629  1.519817  2.185575 -1.396496
E -1.444114 -0.504466  0.160037  0.876169  0.315635
F -2.022201 -0.306204  0.827975  0.230095  0.762011
G -0.222328 -0.200758  0.186561  0.410052  0.198300
H  0.119009 -0.670662  0.377564  0.121821  1.129484
I  1.198918  0.185156 -0.375285 -0.638730  0.423494
J  0.077340 -0.343854  0.043597 -0.620001  0.698032

** Selecting Rows**

In [26]:
dataframe.loc['F']

Score1   -2.022201
Score2   -0.306204
Score3    0.827975
Score4    0.230095
Score5    0.762011
Name: F, dtype: float64

** Or select based off of index position instead of label - use iloc instead of loc function **

In [24]:
dataframe.iloc[2]

Score1   -0.754398
Score2    1.252868
Score3    0.512930
Score4   -0.298093
Score5    0.488518
Name: C, dtype: float64

** Selecting subset of rows and columns using loc function **

In [27]:
dataframe.loc['A','Score1']

0.30017031995582749

In [28]:
dataframe.loc[['A','B'],['Score1','Score2']]

     Score1    Score2
A  0.300170 -0.352250
B  0.586623  0.838983

### Conditional Selection

Similar to NumPy, we can make conditional selections using Brackets

In [29]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894
B  0.586623  0.838983  0.931102  0.285587  0.885141
C -0.754398  1.252868  0.512930 -0.298093  0.488518
D -0.075572  1.131629  1.519817  2.185575 -1.396496
E -1.444114 -0.504466  0.160037  0.876169  0.315635
F -2.022201 -0.306204  0.827975  0.230095  0.762011
G -0.222328 -0.200758  0.186561  0.410052  0.198300
H  0.119009 -0.670662  0.377564  0.121821  1.129484
I  1.198918  0.185156 -0.375285 -0.638730  0.423494
J  0.077340 -0.343854  0.043597 -0.620001  0.698032

In [30]:
dataframe>0.5

   Score1  Score2  Score3  Score4  Score5
A   False   False   False   False   False
B    True    True    True   False    True
C   False    True    True   False   False
D   False    True    True    True   False
E   False   False   False    True   False
F   False   False    True   False    True
G   False   False   False   False   False
H   False   False   False   False    True
I    True   False   False   False   False
J   False   False   False   False    True

In [31]:
dataframe[dataframe>0.5]

     Score1    Score2    Score3    Score4    Score5
A       NaN       NaN       NaN       NaN       NaN
B  0.586623  0.838983  0.931102       NaN  0.885141
C       NaN  1.252868  0.512930       NaN       NaN
D       NaN  1.131629  1.519817  2.185575       NaN
E       NaN       NaN       NaN  0.876169       NaN
F       NaN       NaN  0.827975       NaN  0.762011
G       NaN       NaN       NaN       NaN       NaN
H       NaN       NaN       NaN       NaN  1.129484
I  1.198918       NaN       NaN       NaN       NaN
J       NaN       NaN       NaN       NaN  0.698032

In [32]:
dataframe[dataframe['Score1']>0.5]

     Score1    Score2    Score3    Score4    Score5
B  0.586623  0.838983  0.931102  0.285587  0.885141
I  1.198918  0.185156 -0.375285 -0.638730  0.423494

In [33]:
dataframe[dataframe['Score1']>0.5]['Score2']

B    0.838983
I    0.185156
Name: Score2, dtype: float64

In [34]:
dataframe[dataframe['Score1']>0.5][['Score2','Score3']]

     Score2    Score3
B  0.838983  0.931102
I  0.185156 -0.375285

For multiple conditions you can use | and & with parenthesis

In [37]:
dataframe[(dataframe['Score1']>0.5) & (dataframe['Score2'] > 0)]

     Score1    Score2    Score3    Score4    Score5
B  0.586623  0.838983  0.931102  0.285587  0.885141
I  1.198918  0.185156 -0.375285 -0.638730  0.423494

## More Index Details

Some more features of indexing includes 
  - resetting the index 
  - setting a different value
  - index hierarchy

In [39]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.300170 -0.352250 -1.142518 -0.349343 -0.208894
B  0.586623  0.838983  0.931102  0.285587  0.885141
C -0.754398  1.252868  0.512930 -0.298093  0.488518
D -0.075572  1.131629  1.519817  2.185575 -1.396496
E -1.444114 -0.504466  0.160037  0.876169  0.315635
F -2.022201 -0.306204  0.827975  0.230095  0.762011
G -0.222328 -0.200758  0.186561  0.410052  0.198300
H  0.119009 -0.670662  0.377564  0.121821  1.129484
I  1.198918  0.185156 -0.375285 -0.638730  0.423494
J  0.077340 -0.343854  0.043597 -0.620001  0.698032

In [53]:
# Reset to default index value instead of A to J
dataframe.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     A -0.447129  1.224508  0.403492  0.593579 -1.094912
1     B  0.169382  0.740556 -0.953701 -0.266219  0.032615
2     C -1.373117  0.315159  0.846161 -0.859516  0.350546
3     D -1.312283 -0.038696 -1.615772  1.121418  0.408901
4     E -0.024617 -0.775162  1.273756  1.967102 -1.857982
5     F  1.236164  1.627651  0.338012 -1.199268  0.863345
6     G -0.180920 -0.603921 -1.230058  0.550537  0.792807
7     H -0.623531  0.520576 -1.144341  0.801861  0.046567
8     I -0.186570 -0.101746  0.868886  0.750412  0.529465
9     J  0.137701  0.077821  0.618380  0.232495  0.682551

In [54]:
# Setting new index value
newindex = 'IND JP CAN GE IT PL FY IU RT IP'.split()

In [55]:
dataframe['Countries'] = newindex

In [56]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A -0.447129  1.224508  0.403492  0.593579 -1.094912       IND
B  0.169382  0.740556 -0.953701 -0.266219  0.032615        JP
C -1.373117  0.315159  0.846161 -0.859516  0.350546       CAN
D -1.312283 -0.038696 -1.615772  1.121418  0.408901        GE
E -0.024617 -0.775162  1.273756  1.967102 -1.857982        IT
F  1.236164  1.627651  0.338012 -1.199268  0.863345        PL
G -0.180920 -0.603921 -1.230058  0.550537  0.792807        FY
H -0.623531  0.520576 -1.144341  0.801861  0.046567        IU
I -0.186570 -0.101746  0.868886  0.750412  0.529465        RT
J  0.137701  0.077821  0.618380  0.232495  0.682551        IP

In [57]:
dataframe.set_index('Countries')

             Score1    Score2    Score3    Score4    Score5
Countries
IND       -0.447129  1.224508  0.403492  0.593579 -1.094912
JP         0.169382  0.740556 -0.953701 -0.266219  0.032615
CAN       -1.373117  0.315159  0.846161 -0.859516  0.350546
GE        -1.312283 -0.038696 -1.615772  1.121418  0.408901
IT        -0.024617 -0.775162  1.273756  1.967102 -1.857982
PL         1.236164  1.627651  0.338012 -1.199268  0.863345
FY        -0.180920 -0.603921 -1.230058  0.550537  0.792807
IU        -0.623531  0.520576 -1.144341  0.801861  0.046567
RT        -0.186570 -0.101746  0.868886  0.750412  0.529465
IP         0.137701  0.077821  0.618380  0.232495  0.682551

In [59]:
# Once again, ensure that you input inplace=TRUE
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A -0.447129  1.224508  0.403492  0.593579 -1.094912       IND
B  0.169382  0.740556 -0.953701 -0.266219  0.032615        JP
C -1.373117  0.315159  0.846161 -0.859516  0.350546       CAN
D -1.312283 -0.038696 -1.615772  1.121418  0.408901        GE
E -0.024617 -0.775162  1.273756  1.967102 -1.857982        IT
F  1.236164  1.627651  0.338012 -1.199268  0.863345        PL
G -0.180920 -0.603921 -1.230058  0.550537  0.792807        FY
H -0.623531  0.520576 -1.144341  0.801861  0.046567        IU
I -0.186570 -0.101746  0.868886  0.750412  0.529465        RT
J  0.137701  0.077821  0.618380  0.232495  0.682551        IP

In [60]:
dataframe.set_index('Countries',inplace=True)

In [61]:
dataframe

             Score1    Score2    Score3    Score4    Score5
Countries
IND       -0.447129  1.224508  0.403492  0.593579 -1.094912
JP         0.169382  0.740556 -0.953701 -0.266219  0.032615
CAN       -1.373117  0.315159  0.846161 -0.859516  0.350546
GE        -1.312283 -0.038696 -1.615772  1.121418  0.408901
IT        -0.024617 -0.775162  1.273756  1.967102 -1.857982
PL         1.236164  1.627651  0.338012 -1.199268  0.863345
FY        -0.180920 -0.603921 -1.230058  0.550537  0.792807
IU        -0.623531  0.520576 -1.144341  0.801861  0.046567
RT        -0.186570 -0.101746  0.868886  0.750412  0.529465
IP         0.137701  0.077821  0.618380  0.232495  0.682551

# Part 3

# Missing Data

Methods to deal with missing data in Pandas

In [8]:
dataframe = pd.DataFrame({'Cricket':[1,2,np.nan,4,6,7,2,np.nan],
                  'Baseball':[5,np.nan,np.nan,5,7,2,4,5],
                  'Tennis':[1,2,3,4,5,6,7,8]})

In [9]:
dataframe

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       NaN      2.0       2
2       NaN      NaN       3
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      NaN       8

In [10]:
dataframe.dropna()

   Baseball  Cricket  Tennis
0       5.0      1.0       1
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7

In [12]:
dataframe.dropna(axis=1)       # Use axis=1 for dropping columns with nan values

   Tennis
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8

In [13]:
dataframe.dropna(thresh=2)

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       NaN      2.0       2
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      NaN       8

In [14]:
dataframe.fillna(value=0)

   Baseball  Cricket  Tennis
0       5.0      1.0       1
1       0.0      2.0       2
2       0.0      0.0       3
3       5.0      4.0       4
4       7.0      6.0       5
5       2.0      7.0       6
6       4.0      2.0       7
7       5.0      0.0       8

In [15]:
dataframe['Baseball'].fillna(value=dataframe['Baseball'].mean())

0    5.000000
1    4.666667
2    4.666667
3    5.000000
4    7.000000
5    2.000000
6    4.000000
7    5.000000
Name: Baseball, dtype: float64

# Part 4

# Groupby

The groupby method is used to group rows together and perform aggregate functions

In [2]:
# Create dataframe as given below
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [4]:
dataframe = pd.DataFrame(dat)

In [5]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

** We can now use the .groupby() method to group rows together based on a column name. For example let's group based on CustID. This will create a DataFrameGroupBy object:**

In [7]:
dataframe.groupby('CustID')

This object can be saved as a variable

In [11]:
CustID_grouped = dataframe.groupby("CustID")

Now we can aggregate using the variable

In [9]:
CustID_grouped.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

#### Or we can call the groupby function for each aggregation

In [12]:
dataframe.groupby('CustID').mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

Some more examples

In [13]:
CustID_grouped.std()

        Profitinlakhs
CustID
1001       876.812409
1002      5317.442995
1003      1354.816593

In [14]:
CustID_grouped.min()

        CustName  Profitinlakhs
CustID
1001      DatRob           2005
1002    Chrysler           1245
1003        Ford           3547

In [15]:
CustID_grouped.max()

       CustName  Profitinlakhs
CustID
1001      UIPat           3245
1002       Goog           8765
1003         GM           5463

In [16]:
CustID_grouped.count()

        CustName  Profitinlakhs
CustID
1001           2              2
1002           2              2
1003           2              2

In [17]:
CustID_grouped.describe()

       Profitinlakhs                                                       \
               count    mean          std     min     25%     50%     75%
CustID
1001             2.0  2625.0   876.812409  2005.0  2315.0  2625.0  2935.0
1002             2.0  5005.0  5317.442995  1245.0  3125.0  5005.0  6885.0
1003             2.0  4505.0  1354.816593  3547.0  4026.0  4505.0  4984.0


           max
CustID
1001    3245.0
1002    8765.0
1003    5463.0

In [18]:
CustID_grouped.describe().transpose()

CustID                      1001         1002         1003
Profitinlakhs count     2.000000     2.000000     2.000000
              mean   2625.000000  5005.000000  4505.000000
              std     876.812409  5317.442995  1354.816593
              min    2005.000000  1245.000000  3547.000000
              25%    2315.000000  3125.000000  4026.000000
              50%    2625.000000  5005.000000  4505.000000
              75%    2935.000000  6885.000000  4984.000000
              max    3245.000000  8765.000000  5463.000000

In [19]:
CustID_grouped.describe().transpose()['1001']

Profitinlakhs  count       2.000000
               mean     2625.000000
               std       876.812409
               min      2005.000000
               25%      2315.000000
               50%      2625.000000
               75%      2935.000000
               max      3245.000000
Name: 1001, dtype: float64

# Part 5

# Merging, Joining, and Concatenating

There are 3 important ways of combining DataFrames together: 
  - Merging 
  - Joining
  - Concatenating

### Example DataFrames

In [17]:
dafa1 = pd.DataFrame({'CustID': ['101', '102', '103', '104'],
                        'Sales': [13456, 45321, 54385, 53212],
                        'Priority': ['CAT0', 'CAT1', 'CAT2', 'CAT3'],
                        'Prime': ['yes', 'no', 'no', 'yes']},
                        index=[0, 1, 2, 3])

In [18]:
dafa2 = pd.DataFrame({'CustID': ['101', '103', '104', '105'],
                        'Sales': [13456, 54385, 53212, 4534],
                        'Payback': ['CAT4', 'CAT5', 'CAT6', 'CAT7'],
                        'Imp': ['yes', 'no', 'no', 'no']},
                         index=[4, 5, 6, 7])

In [19]:
dafa3 = pd.DataFrame({'CustID': ['101', '104', '105', '106'],
                        'Sales': [13456, 53212, 4534, 3241],
                        'Pol': ['CAT8', 'CAT9', 'CAT10', 'CAT11'],
                        'Level': ['yes', 'no', 'no', 'yes']},
                        index=[8, 9, 10, 11])

In [20]:
dafa1

  CustID Prime Priority  Sales
0    101   yes     CAT0  13456
1    102    no     CAT1  45321
2    103    no     CAT2  54385
3    104   yes     CAT3  53212

In [21]:
dafa2

  CustID  Imp Payback  Sales
4    101  yes    CAT4  13456
5    103   no    CAT5  54385
6    104   no    CAT6  53212
7    105   no    CAT7   4534

In [22]:
dafa3

   CustID Level    Pol  Sales
8     101   yes   CAT8  13456
9     104    no   CAT9  53212
10    105    no  CAT10   4534
11    106   yes  CAT11   3241

## Concatenation

Concatenation joins DataFrames basically either by rows or colums(axis=0 or 1).

We also need to ensure dimension sizes of dataframes are the same

In [23]:
pd.concat([dafa1,dafa2])

   CustID  Imp Level Payback    Pol Prime Priority  Sales
0     101  NaN   NaN     NaN    NaN   yes     CAT0  13456
1     102  NaN   NaN     NaN    NaN    no     CAT1  45321
2     103  NaN   NaN     NaN    NaN    no     CAT2  54385
3     104  NaN   NaN     NaN    NaN   yes     CAT3  53212
4     101  yes   NaN    CAT4    NaN   NaN      NaN  13456
5     103   no   NaN    CAT5    NaN   NaN      NaN  54385
6     104   no   NaN    CAT6    NaN   NaN      NaN  53212
7     105   no   NaN    CAT7    NaN   NaN      NaN   4534
8     101  NaN   yes     NaN   CAT8   NaN      NaN  13456
9     104  NaN    no     NaN   CAT9   NaN      NaN  53212
10    105  NaN    no     NaN  CAT10   NaN      NaN   4534
11    106  NaN   yes     NaN  CAT11   NaN      NaN   3241

In [13]:
pd.concat([dafa1,dafa2,dafa3],axis=1)

,Level1,Level2,Level3,Level4,Level1,Level2,Level3,Level4,Level1,Level2,Level3,Level4
0,SAP0,BD0,CAT0,DS0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,SAP1,BD1,CAT1,DS1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,SAP2,BD2,CAT2,DS2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,SAP3,BD3,CAT3,DS3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,SAP4,BD4,CAT4,DS4,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,SAP5,BD5,CAT5,DS5,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,SAP6,BD6,CAT6,DS6,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,SAP7,BD7,CAT7,DS7,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SAP8,BD8,CAT8,DS8
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SAP9,BD9,CAT9,DS9
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SAP10,BD10,CAT10,DS10
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SAP11,BD11,CAT11,DS11

_____
## Example DataFrames

In [27]:
Table1 = pd.DataFrame({'CustID': ['1001', '1002', '1003', '1004'],
                     'Q1': ['101', '102', '103', '104'],
                     'Q2': ['201', '202', '203', '204']})
   
Table2 = pd.DataFrame({'CustID': ['1001', '1006', '1003', '1004'],
                          'Q3': ['301', '302', '303', '304'],
                          'Q4': ['401', '402', '403', '404']})

In [28]:
Table1

  CustID   Q1   Q2
0   1001  101  201
1   1002  102  202
2   1003  103  203
3   1004  104  204

In [29]:
Table2

  CustID   Q3   Q4
0   1001  301  401
1   1006  302  402
2   1003  303  403
3   1004  304  404

## Merging

Just like SQL tables, merge function in python allows us to merge dataframes

In [31]:
pd.merge(dafa1,dafa2,how='outer',on='CustID')

  CustID   Q1   Q2   Q3   Q4
0   1001  101  201  301  401
1   1002  102  202  NaN  NaN
2   1003  103  203  303  403
3   1004  104  204  304  404
4   1006  NaN  NaN  302  402

## Joining

Join can be used to combine columns of 2 dataframes that have different index values into a signle dataframe

The one difference between merge and join is that, merge uses common columns to combine two dataframes, whereas join uses the row index to join two dataframes

In [24]:
daf3 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2']) 

dafa4 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [25]:
Table1.join(Table2)

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402

In [26]:
Table1.join(Table2, how='outer')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  NaN  NaN
I2  103  203  302  402
I3  NaN  NaN  303  403

# Part 6

# Operations

Let us discuss some useful Operations using Pandas

In [1]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],'SaleType':['big','small','medium','big'],'SalesCode':['121','131','141','151']})
dataframe.head()

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

### Info on Unique Values

In [3]:
dataframe['SaleType'].unique()

array(['big', 'small', 'medium'], dtype=object)

In [4]:
dataframe['SaleType'].nunique()

3

In [5]:
dataframe['SaleType'].value_counts()

big       2
medium    1
small     1
Name: SaleType, dtype: int64

### Selecting Data

In [11]:
#Select from DataFrame using criteria from multiple columns
newdataframe = dataframe[(dataframe['custID']!=3) & (dataframe['SaleType']=='big')]

In [12]:
newdataframe

  SaleType SalesCode  custID
0      big       121       1
3      big       151       4

### Applying Functions

In [27]:
def profit(a):
    return a*4

In [30]:
dataframe['custID'].apply(profit)

0     4
1     8
2    12
3    16
Name: custID, dtype: int64

In [23]:
dataframe['SaleType'].apply(len)

0    3
1    5
2    6
3    3
Name: SaleType, dtype: int64

In [24]:
dataframe['custID'].sum()

10

** Permanently Removing a Column**

In [25]:
del dataframe['custID']

In [26]:
dataframe

  SaleType SalesCode
0      big       121
1    small       131
2   medium       141
3      big       151

** Get column and index names: **

In [31]:
dataframe.columns

Index(['SaleType', 'SalesCode', 'custID'], dtype='object')

In [32]:
dataframe.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [33]:
dataframe

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

In [34]:
dataframe.sort_values(by='SaleType') #inplace=False by default

  SaleType SalesCode  custID
0      big       121       1
3      big       151       4
2   medium       141       3
1    small       131       2

** Find Null Values or Check for Null Values**

In [35]:
dataframe.isnull()

   SaleType  SalesCode  custID
0     False      False   False
1     False      False   False
2     False      False   False
3     False      False   False

In [36]:
# Drop rows with NaN Values
dataframe.dropna()

  SaleType SalesCode  custID
0      big       121       1
1    small       131       2
2   medium       141       3
3      big       151       4

** Filling in NaN values with something else: **

In [37]:
import numpy as np

In [41]:
dataframe = pd.DataFrame({'Sale1':[5,np.nan,10,np.nan],
                   'Sale2':[np.nan,121,np.nan,141],
                   'Sale3':['XUI','VYU','NMA','IUY']})
dataframe.head()

   Sale1  Sale2 Sale3
0    5.0    NaN   XUI
1    NaN  121.0   VYU
2   10.0    NaN   NMA
3    NaN  141.0   IUY

In [42]:
dataframe.fillna('Not nan')

     Sale1    Sale2 Sale3
0        5  Not nan   XUI
1  Not nan      121   VYU
2       10  Not nan   NMA
3  Not nan      141   IUY

# Part 7

# Data Input and Output

Reading DataFrames from external sources using pd.read functions

## CSV

### CSV Input

In [3]:
dataframe = pd.read_csv('pandas-train.csv')

### CSV Output

In [6]:
dataframe.to_csv('train2.csv',index=False)    #If index=FALSE then csv does not store index values

## Excel

Using Pandas, one can read excel files, however it can only import data. It does not fetch formulae or any formatting/images/macros and having such things in excel files can crash the python function to crash and not execute successfully.

### Excel Input

In [10]:
pd.read_excel('pandas-Consumer.xlsx',sheet_name='Data1')

    Income  HouseholdSize  AmountCharged
0       54              3           4016
1       30              2           3159
2       32              4           5100
3       50              5           4742
4       31              2           1864
5       55              2           4070
6       37              1           2731
7       40              2           3348
8       66              4           4764
9       51              3           4110
10      25              3           4208
11      48              4           4219
12      27              1           2477
13      33              2           2514
14      65              3           4214
15      63              4           4965
16      42              6           4412
17      21              2           2448
18      44              1           2995
19      37              5           4171
20      62              6           5678
21      21              3           3623
22      55              7           5301
23      42              2           3020
24      41              7           4828
25      54              6           5573
26      30              1           2583
27      48              2           3866
28      34              5           3586
29      67              4           5037
30      50              2           3605
31      67              5           5345
32      55              6           5370
33      52              2           3890
34      62              3           4705
35      64              2           4157
36      22              3           3579
37      29              4           3890
38      39              2           2972
39      35              1           3121
40      39              4           4183
41      54              3           3730
42      23              6           4127
43      27              2           2921
44      26              7           4603
45      61              2           4273
46      30              2           3067
47      22              4           3074
48      46              5           4820
49      66              4           5149

### Excel Output

In [12]:
dataframe.to_excel('Consumer2.xlsx',sheet_name='Sheet1')

# End of Pandas Section